ERP.belugaerp/src/Catalogs/бг_ПоказателиАнализовНоменклатуры/бг_ПоказателиАнализовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_ПоказателиАнализовНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидРезультата</name>
    <type>
      <types>EnumRef.бг_ВидыРезультатовЛабораторныхАнализов</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопустимыеЗначенияПоказателей</name>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>CatalogRef.бг_ЗначенияПоказателейАнализовНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Enums/бг_ВидыРезультатовЛабораторныхАнализов/бг_ВидыРезультатовЛабораторныхАнализов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВидыРезультатовЛабораторныхАнализов</name>
  <enumValues>
    <name>ЗначениеСПогрешностью</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеИзСписка</name>
  </enumValues>
  <enumValues>
    <name>Поддиапазон</name>
  </enumValues>
  <enumValues>
    <name>ЧислоВИнтервале</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/бг_ПоказателиАнализовНоменклатуры/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьСтраницуВидРезультатаПоказателя();
	
	Если Объект.ВидРезультата = Перечисления.бг_ВидыРезультатовЛабораторныхАнализов.ЗначениеСПогрешностью Тогда
		ЗаполнитьЗначениеИПогрешностьПоказателя();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидРезультатаПриИзменении(Элемент)
	УстановитьСтраницуВидРезультатаПоказателя();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателяПриИзменении(Элемент)
	ЗаполнитьМинимальноеМаксимальноеЗначениеПоЗначениюИПогрешности();
КонецПроцедуры

&НаКлиенте
Процедура ПогрешностьЗначенияПриИзменении(Элемент)
	ЗаполнитьМинимальноеМаксимальноеЗначениеПоЗначениюИПогрешности();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСтраницуВидРезультатаПоказателя()
	Если Объект.ВидРезультата = Перечисления.бг_ВидыРезультатовЛабораторныхАнализов.ЗначениеИзСписка Тогда
		Элементы.СтраницыПоказателиАнализов.ТекущаяСтраница = Элементы.СтраницаПоказателиЗначениеИзСписка;
	ИначеЕсли Объект.ВидРезультата = Перечисления.бг_ВидыРезультатовЛабораторныхАнализов.ЗначениеСПогрешностью Тогда
		Элементы.СтраницыПоказателиАнализов.ТекущаяСтраница = Элементы.СтраницаПоказателиАнализовЗначение;
	ИначеЕсли Объект.ВидРезультата = Перечисления.бг_ВидыРезультатовЛабораторныхАнализов.Поддиапазон Тогда
		Элементы.СтраницыПоказателиАнализов.ТекущаяСтраница = Элементы.СтраницаПоказателиПоддиапазон;
	Иначе
		Элементы.СтраницыПоказателиАнализов.ТекущаяСтраница = Элементы.СтраницаПоказателиАнализовИнтервал;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМинимальноеМаксимальноеЗначениеПоЗначениюИПогрешности()
	Объект.МинимальноеЗначение = ЗначениеПоказателя - ПогрешностьЗначения;
	Объект.МаксимальноеЗначение = ЗначениеПоказателя + ПогрешностьЗначения;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениеИПогрешностьПоказателя()
	ЗначениеПоказателя = (Объект.МинимальноеЗначение + Объект.МаксимальноеЗначение) / 2;
	ПогрешностьЗначения = Объект.МаксимальноеЗначение - ЗначениеПоказателя;
КонецПроцедуры

#КонецОбласти
